In [24]:
import pandas as pd
import numpy as np

In [25]:
dfMale = pd.read_csv("Indian-Male-Names.csv")
dfFemale = pd.read_csv("Indian-Female-Names.csv")
dfComplex = pd.read_csv("Indian-complex-names.csv")

In [26]:
dfComplex = dfComplex.iloc[1000:3000, :]
dfComplex = dfComplex.reset_index(drop=True)

In [27]:
dfMale.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [28]:
dfFemale.head()

              name gender    race
0          shivani      f  indian
1             isha      f  indian
2  smt shyani devi      f  indian
3            divya      f  indian
4            mansi      f  indian

In [29]:
dfComplex.head()

                         name  gender
0      Shyamalendu Chatterjee    male
1   Parthasaradhi Reddy Bandi    male
2      Bhimavarapu Nagi Reddy    male
3              Krishnaswamy K    male
4  Lakshminarayanan Nagarajan  female

In [30]:
unisexList= []

In [31]:
for x in dfMale["name"]:
    for y in dfFemale["name"]:
        if x == y: unisexList.append(y)

In [32]:
dict = {'name': unisexList, 'gender': 'u'}
dfUnisex = pd.DataFrame(dict)

In [33]:
dfUnisex

              name gender
0           sanjay      u
1             aman      u
2             aman      u
3          durgesh      u
4          durgesh      u
...            ...    ...
12513  vinod kumar      u
12514    raj kumar      u
12515         monu      u
12516       deepak      u
12517       deepak      u

[12518 rows x 2 columns]

In [34]:
dfUnisex = dfUnisex.drop_duplicates(subset='name', keep='first', inplace=False)

In [35]:
dfComplex = dfComplex.rename(columns={"Name": "name"})

In [36]:
dfComplex['name'] = dfComplex['name'].str.lower()

In [37]:
dfComplex.head()

                         name  gender
0      shyamalendu chatterjee    male
1   parthasaradhi reddy bandi    male
2      bhimavarapu nagi reddy    male
3              krishnaswamy k    male
4  lakshminarayanan nagarajan  female

In [38]:
dfComplex.tail()

                                  name  gender
1995  shreekrishna yashvantrao marathe  female
1996             vikramaditya raj ugra  female
1997               virupakshaya himesh  female
1998             venkatraman nagendran    male
1999                    venkatraghavan    male

In [39]:
dfFinal = dfMale.append([dfFemale,dfComplex], ignore_index=True)
del dfFinal['race']

In [40]:
dfFinal

                                   name  gender
0                               barjraj       m
1                          ramdin verma       m
2                       sharat chandran       m
3                       birender mandal       m
4                                  amit       m
...                                 ...     ...
32259  shreekrishna yashvantrao marathe  female
32260             vikramaditya raj ugra  female
32261               virupakshaya himesh  female
32262             venkatraman nagendran    male
32263                    venkatraghavan    male

[32264 rows x 2 columns]

In [41]:
dfFinal.isnull().isnull().sum()

name      0
gender    0
dtype: int64

In [42]:
dfFinal = dfFinal.dropna()

In [43]:
dfFinal = dfFinal.reset_index(drop=True)

In [44]:
dfFinal['gender'].replace({'f': 'female','m': 'male'},inplace=True)

In [45]:
dfFinal

                                   name  gender
0                               barjraj    male
1                          ramdin verma    male
2                       sharat chandran    male
3                       birender mandal    male
4                                  amit    male
...                                 ...     ...
32204  shreekrishna yashvantrao marathe  female
32205             vikramaditya raj ugra  female
32206               virupakshaya himesh  female
32207             venkatraman nagendran    male
32208                    venkatraghavan    male

[32209 rows x 2 columns]

In [49]:
dfFinal[dfFinal.gender == 'male'].shape[0]

16271

In [50]:
dfFinal[dfFinal.gender == 'female'].shape[0]

15938

In [51]:
dfFinal.to_csv(r'Merged-Formatted-Indian-Names.csv', index=False)